src/test/resources/io/2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:soap:functions:mc-style">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:ZmdmMas010>
            <!--Optional:-->
            <Check>X</Check>
            <PMon>01</PMon>
            <PYear>2019</PYear>
            <SRbukrs>
                <!--Zero or more repetitions:-->
                <item>
                    <Sign>I</Sign>
                    <Option>BT</Option>
                    <Low>1000</Low>
                    <High>5999</High>
                </item>
            </SRbukrs>
        </urn:ZmdmMas010>
    </soapenv:Body>
</soapenv:Envelope>